use commerce;

# 데이터
SELECT * FROM commerce;

# 국가별, 상품별 구매자 수 및 매출액
-- 매출액은 반올림해서 나타낼것
-- country의 오름차순, 구매자수의 내림차순, 매출액의 내림차순으로 정렬


# 특정 상품 구매자가 많이 구매한 상품은?
## 가장 많이 판매된 상품
## 가장 많이 판매된 상품이 포함된 주문내역(invoice)
## 가장 많이 판매된 상품과 함께 판매된 다른 상품

# 국가별 재구매율(리텐션)

# 코호트 분석
## 고객별 첫 구매일 구하기
## 고객id, 구매일, 판매액
## 코호트 분석을 위한 테이블 생성하기
## 월단위 코호트 분석하기

# 고객 세그먼트
## RFM
## 재구매 segment
### 먼저 고객별, 제품별로 몇 개 년도에서 구매가 발생했는지를 구해주세요.
### 재구매 segment 나누기
    
# 일자별 첫 구매수 

# 상품별 첫 구매 수

# 첫 구매 후 이탈하는 고객 비중
## 이탈률

# 판매량
## 판매량이 2010년 대비 2011년에 20%이상 증가한 상품 리스트
